#Область ПрограммныйИнтерфейс

// Производит динамическое добавление реквизитов и элементов на форму документов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения  - Контекст модифицируемой формы.
//
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" 
		Или ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" 
		Или ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
		
		Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
			ДобавитьПолеСогласованнаяСкидкаВГруппуШапкаЛево(Форма);
		КонецЕсли;
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента"
		Или ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		
		ДобавитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма)
	
	НовыйЭлемент = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ДР_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	НовыйЭлемент = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.СуммаДокумента);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ДР_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппуШапкаЛево(Форма)
	
	НоваяГруппа = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ДР_СогласованнаяСкидка";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
	
	// Добавим команду для пересчета суммы со скидкой
	Команда = Форма.Команды.Добавить("ПрименитьСкидку");
	Команда.Заголовок = "Применить скидку";
	Команда.Действие = "ПрименитьСкидку";
	
	КнопкаПрименитьСкидку = Форма.Элементы.Добавить("ПрименитьСкидку", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидка);
	КнопкаПрименитьСкидку.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаПрименитьСкидку.Заголовок = "Применить скидку";
	КнопкаПрименитьСкидку.ИмяКоманды = "ПрименитьСкидку";
	
КонецПроцедуры
#КонецОбласти
